-- phpMyAdmin SQL Dump
-- version 4.8.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Mar 27, 2019 at 05:39 AM
-- Server version: 10.1.37-MariaDB
-- PHP Version: 7.3.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `old_books`
--

-- --------------------------------------------------------

--
-- Table structure for table `authors`
--

CREATE TABLE `authors` (
  `id` int(11) NOT NULL,
  `user_id` varchar(60) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `books` varchar(200) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `authors`
--

INSERT INTO `authors` (`id`, `user_id`, `name`, `description`, `books`, `created`) VALUES
(1, '1', 'zahidul', 'dsfsdiouipo oidsfiosdjfiop iosdfiosdjiof jndsfoijiodsjfio', 'hjkhsdjiojoijo ', '2019-02-07 13:03:31');

-- --------------------------------------------------------

--
-- Table structure for table `books`
--

CREATE TABLE `books` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `bookname` varchar(300) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` varchar(60) COLLATE utf8mb4_unicode_ci NOT NULL,
  `author_name` varchar(60) COLLATE utf8mb4_unicode_ci NOT NULL,
  `price` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` set('0','1') COLLATE utf8mb4_unicode_ci NOT NULL,
  `publication` varchar(300) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `books`
--

INSERT INTO `books` (`id`, `user_id`, `bookname`, `description`, `image`, `author_name`, `price`, `status`, `publication`, `created`, `updated`) VALUES
(1, 3, 'আজ ‍চিত্রার বিয়ে2', 'আজআজ চিত্রার বিয়ে একটি উপন্যাস।আজ চিত্রার বিয়ে একটি উপন্যাস।আজ চিত্রার বিয়ে একটি উপন্যাস।আজ চিত্রার বিয়ে একটি উপন্যাস। চিত্রার বিয়ে একটি উপন্যাস।', '', 'হুমায়ন আহম্মেদ', '450', '0', 'রবি পাবলিকেসন্স', '2019-02-24 16:00:11', NULL),
(2, 3, 'বঙ্গবন্ধুর জন্য ভালোবাসা', 'প্রতিটি অর্ডারের সাথে Dano Captain Chocolate Milk একদম ফ্রি!!! ( সীমিত সময়ের জন্য )বিকাশ অ্যাপ এ পেমেন্ট করলে নিশ্চিত ১০% ক্যাশব্যাক! সাথে ৬৯৯+ টাকার পেমেন্টে ফ্রি শিপিং!!!', '1551024296_1654.jpg', 'আনিসুল হক', '180', '0', 'পার্ল পাবলিকেশন্স', '2019-02-24 16:04:56', NULL),
(3, 3, 'ঈশ্বর ও মানুষের গল্প11', 'সংগ্রহে রাখার মত একটি বই! আশা করি সামনে আরো দারুন দারুন বইয়ের অপেক্ষায় রইলাম', '', 'আল মেহেদী', '75', '0', 'ইছামতি প্রকাশনী', '2019-02-24 16:08:39', NULL),
(5, 3, 'ইন্টারভিউ টেকনিকস', 'বুক রিভিউ সরকারি, বেসরকারি, কর্পোরেট, কোম্পানি, এনজিওসহ বিভিন্ন পেশার বিভিন্ন পদের ইন্টারভিউ পরীক্ষা জয় করার জন্য বইটি যাদুকরি ভূমিকা পালন করবে।', '', 'আপেল মাহমুদ', '120', '0', 'ক্যারিয়ার পাবলিকেশন্স', '2019-02-24 16:20:30', NULL),
(6, 3, 'ভাল্লাগে না ', 'শত অজুহাতে জর্জরিত আমাদের জীবন। দিনশেষে আমাদের অজুহাতে আমরা নিজেরাই পরাহত। ', '', 'আয়মান সাদিক ,  অন্তিক মাহমুদ', '225', '0', 'আদর্শ', '2019-02-24 16:23:38', NULL),
(7, 3, 'স্টুডেন্ট হ্যাকস ', 'আয়মান ভাইয়ার বই মানেই ছাত্রদের জন্য নতুন কিছু। একঘেয়ামী পড়াশোনাকে কিভাবে আনন্দময় ও মজার করা যায় সে উদ্দেশ্যে আয়মান ভাইয়া ও সাদমান ভাইয়ার লেখা এই বইটি সত্যিই খুব ইন্টারেস্টিং। ', '', 'আয়মান সাদিক ,  সাদমান সাদিক', '225', '0', 'অধ্যয়ন', '2019-02-24 16:25:37', NULL),
(8, 3, 'নেভার স্টপ লার্নিং (হার্ডকভার)', 'একবিংশ শতাব্দির এই প্রতিযোগিতার মাঝে পাঠ্যবইয়ের জ্ঞানের পাশাপাশি একজন ছাত্রের প্রয়োজন বাস্তব জীবনের কিছু কোশল ও হ্যাক সম্পর্কে জানা। ', '1551025653_1257.jpg', 'আয়মান সাদিক', '203', '0', 'অধ্যয়ন', '2019-02-24 16:27:33', NULL),
(9, 3, 'মুক্তিযুদ্ধের ইতিহাস', 'সাধারন বইয়ের থেকে আকারে অনেক ছোট, পৃষ্ঠা সংখ্যাও গুটিকয়েক। কিন্তু এই ছোট বইখানায় জাফর ইকবাল স্যার আমাদের মুক্তিযুদ্ধের যে ইতিহাস তুলে ধরেছেন টা অবিশ্বাস্য। ', '1551025763_2461.jpg', 'মুহম্মদ জাফর ইকবাল', '10', '0', 'প্রতীতি', '2019-02-24 16:29:23', NULL),
(10, 3, 'বিজ্ঞানের একশ মজার খেলা', 'বইটি প্রথমত স্কুল শিক্ষার্থীদের জন্যই বলবো ।তার পিছনে যুক্তিসংগত কারণ রয়েছে । ', '1551026029_2063.jpg', 'মুহম্মদ জাফর ইকবাল', '75', '0', 'জ্ঞানকোষ প্রকাশনী', '2019-02-24 16:33:49', NULL),
(11, 3, 'গণিতের রঙ্গে হাসিখুশি গণিত (হার্ডকভার)', 'বইয়া যদি কেউ না নিয়ে থাকেন তবে এখনই নিয়ে নেন। অসাধারণ একটা বই না পড়লে বুঝবেন না। গনিতের ইতিহাস নিয়ে আলোচনা করা হয়েছে এই বইয়ে।', '1551026131_2034.jpg', 'চমক হাসান', '188', '0', 'আদর্শ', '2019-02-24 16:35:31', NULL),
(12, 3, 'দেবী (হার্ডকভার)', 'হুমায়ূন আহমেদের অত্ত্যন্ত পাঠকপ্রিয় এবং একইসাথে সমালোচক প্রিয় &#039;মিসির আলি&#039; সিরিজের প্রথম বই দেবী। ', '1551026284_3281.jpg', ' হুমায়ূন আহমেদ', '113', '0', 'অবসর প্রকাশনা সংস্থা', '2019-02-24 16:38:04', NULL),
(13, 3, 'ময়ূরাক্ষী (হিমু সিরিজের প্রথম বই) (হার্ডকভার)', 'বাংলা সাহিত্য তার ভান্ডারে \'উপন্যাস\' কে নিয়ে আসে প্যারীচাঁদ মিত্রের হাত ধরে। ', '1551026432_2161.gif', 'হুমায়ন আহম্মেদ', '101', '0', ' অনন্যা', '2019-02-24 16:40:32', NULL),
(14, 3, 'কৃষ্ণপক্ষ', 'কৃষ্ণপক্ষ\' উপন্যাসটি হুমায়ুন আহমেদের নিজেরই অত্যন্ত প্রিয় একটি উপন্যাস, এবং সে কথা তিনি নিজেই বিভিন্ন সময় তাঁর নানা রচনার মাধ্যমে জানিয়ে গেছেন।', '1551026510_4683.jpg', 'হুমায়ন আহম্মেদ', '113', '0', 'সুবর্ণ', '2019-02-24 16:41:50', NULL),
(15, 3, 'নবনী (হার্ডকভার)', 'নবনী বইটি পরে ভাল লাগল। তবে প্রথমে মনে করেছিলাম, বইটি হইত আশাভঙ্গের হবে নাহ! কিন্তু শুরুটা যতটা আশা জাগরণের মনে হয়েছিল,তা হইনি।', '1551026741_3453.jpg', 'হুমায়ন আহম্মেদ', '150', '0', 'সময় প্রকাশন', '2019-02-24 16:45:41', NULL),
(16, 3, 'আকাশ জোড়া মেঘ (হার্ডকভার)', 'হুমায়ূন আহমেদের ‘আকাশ জোড়া মেঘ’ একাধারে নিখাদ প্রেমের উপন্যাস এবং তৎকালীন সময়ের শহুরে সামাজিক জীবনের বাস্তব প্রতিবিম্ব। ', '1551026834_4901.jpg', 'হুমায়ন আহম্মেদ', '150', '0', 'প্রতীক প্রকাশনা সংস্থা', '2019-02-24 16:47:14', NULL),
(17, 3, 'বি স্মার্ট উইথ মুহাম্মাদ (শিশু মুহাম্মাদ, কিশোর মুহাম্মাদ এবং নবুয়তের আগের যুবক মুহাম্মাদ সাঃ এর জীবনী) (হার্ডকভার)', 'একটি বই, কিছু বিতর্ক এবং আমার পর্যবেক্ষণ পূর্ব-কথা গার্ডিয়ান পাবলিকেশনস থেকে প্রকাশিত মাসুদ শরীফের অনুবাদ করা বই \'বি স্মার্ট উইথ মুহাম্মাদ\' নিয়ে পক্ষে-বিপক্ষে মতামত দেখেছি।', '1551027182_1893.jpg', 'হিশাম আল আওয়াদি', '175', '0', 'গার্ডিয়ান পাবলিকেশন', '2019-02-24 16:53:02', NULL),
(18, 3, 'এরদোয়ানঃ দ্যা চেঞ্জ মেকার (হার্ডকভার)', 'ইস্তাম্বুলের রাস্তায় রুটি আর শরবত ফেরী করে বিক্রি করছে এক সুদর্শন যুবক। বিক্রির এই টাকা দিয়ে নিজের পড়াশুনার খরচ সাথে ছোট ভাইদের পড়ার খরচ চলবে। ', '1551027273_3742.jpg', ' হাফিজুর রহমান (পিএইচডি)', '280', '0', 'গার্ডিয়ান পাবলিকেশন', '2019-02-24 16:54:33', NULL),
(19, 3, 'প্রত্যাবর্তন (পেপারব্যাক)', 'দেশের শীর্ষ মেডিকেল কলেজ, বুয়েট, কুয়েট, রুয়েট, শীর্ষ বিশ্ববিদ্যালয়, অক্সফোর্ড এবং ক্যামব্রিজ ইউনিভার্সিটিতে অধ্যয়নরত আমাদের এক ঝাঁক তরুণ ভাই-বোনদের দ্বীনে ফিরে আসার গল্প।', '1551029753_3200.jpg', 'আরিফ আজাদ', '225', '0', ' সমকালীন প্রকাশন', '2019-02-24 17:35:53', NULL),
(20, 3, 'কষ্টিপাথর (হার্ডকভার)', 'কী বই পড়তেছিস? নাম দেখি? - কষ্টিপাথর - ওহ! (যার নামই এমন তার ভেতরে কী থাকতে পারে তা বোঝা হয়ে গেছে) বাহ! ', '1551030296_2224.jpg', 'ডা. শামসুল আরেফীন', '150', '0', 'শুদ্ধি প্রকাশনী', '2019-02-24 17:44:56', NULL),
(21, 3, 'আউটসোর্সিং : শুরুটা যেভাবে এবং শুরু করার পর (হার্ডকভার)', 'শুরু টা যেভাবে এবং শুরু করার পর,,,নামটা চমৎকার। লেখেকের আত্ববিশ্বাস পড়ে মনে হচেছ নতুন হিসাবে যারা আউটসোর্সিং শুরু করতে চায় তাদের জন্য একটি চমৎকার বই', '1551030413_1584.jpg', 'মো. আমিনুর রহমান', '120', '0', 'তাম্রলিপি', '2019-02-24 17:46:53', NULL),
(22, 3, 'জিন ও ফেরেশতাদের বিস্ময়কর ইতিহাস', 'জিন ও ফেরেশতাদের বিস্ময়কর ইতিহাস \r\nজিন ও ফেরেশতাদের বিস্ময়কর ইতিহাস (হার্ডকভার) জিন ও ফেরেশতাদের বিস্ময়কর ইতিহাস (হার্ডকভার) জিন ও ফেরেশতাদের বিস্ময়কর ইতিহাস (হার্ডকভার)', '1551086439_2665.gif', 'আল্লামা জালালউদ্দিন সুয়ূতী', '360', '0', 'মীনা বুক হাউস ', '2019-02-25 09:20:39', NULL),
(23, 3, 'আল কুরআন এক মহাবিস্ময় ', 'ভূমিকা\r\nআল কুরআন ও আধুনিক বিজ্ঞান : ডঃ মরিস বুকাইলি\r\nআল কুরআনে ভ্রণতত্ত্ব : ডঃ কিথ এল. মূল\r\nআল কুরআন - এক মহাবিস্ময় : গ্যারি মিলার\r\nপরিশিষ্ট : খোন্দকার রোকনুজ্জামান\r\nবিস্ময়ের সেকাল\r\nবিস্ময়ের একাল ', '1551091826_4995.jpg', 'ড. মরিস বুকাইলি', '400', '0', 'বাংলাদেশ ইসলামিক সেন্টার ', '2019-02-25 10:50:26', NULL),
(24, 20, 'ফেরা (পেপারব্যাক)', 'সিহিন্তা শরীফাহ , নাইলাহ আমাতুল্লাহ  সিহিন্তা শরীফাহ , নাইলাহ আমাতুল্লাহ  সিহিন্তা শরীফাহ , নাইলাহ আমাতুল্লাহ ', '1551096313_4114.jpg', 'নাইলাহ আমাতুল্লাহ ', '113', '0', 'সমকালীন প্রকাশন ', '2019-02-25 12:05:13', NULL),
(25, 20, 'bangla book', 'সমকালীন প্রকাশন সমকালীন প্রকাশন সমকালীন প্রকাশন সমকালীন প্রকাশন সমকালীন প্রকাশন সমকালীন প্রকাশন সমকালীন প্রকাশন সমকালীন প্রকাশন সমকালীন প্রকাশন ', '1551098845_2635.jpg', 'নাইলাহ আমাতুল্লাহ ', '120', '0', 'সমকালীন প্রকাশন ', '2019-02-25 12:47:25', NULL),
(26, 3, 'লা মিজারেবল', 'ভিক্টর মারি হুগো ২৬ ফেব্রুয়ারি ১৮০২ সালে ফ্রান্সে জন্মগ্রহন করেন। নেপোলিয়ন বোনাপার্টের বিশাল সেনাবাহিনীর উচ্চপদস্থ একজন কর্মকর্তার সন্তান ছিলেন তিনি। একাধারে সাহিত্য এবং রাজনীতিতে জড়িত ছিলেন। ফ্রান্সে সা¤্রাজ্য আইন থেকে গণতান্ত্রিক ব্যবস্থায় পরিবর্তিত হওয়া এবং সেই প্রক্রিয়ার নানান উত্থান-পতনে তিনি সরাসরি অংশগ্রহণ করেছিলেন। প্যারিসে বসবাসরত ভিক্টর হুগো তরুণ বয়সেই তার কবিতা, কল্পকাহিনি এবং নাটকের জন্য বিখ্যাত এবং কখনো কুখ্যাতও হয়েছিলেন। ১৮৪৫ সালে, তার বিখ্যাত গ্রন্থ লা মিজারেবল লেখার সময়, রাজা তাকে ফ্রান্সের উচ্চকক্ষের সদস্য হিসেবে গ্রহণ করেন। ', '1551111465_2936.jpg', 'ভিক্টর হুগো ', '148', '0', 'ন্যাশনাল পাবলিকেশন ', '2019-02-25 16:17:45', NULL),
(27, 21, 'আরব্য রজনীর মহানায়ক (হার্ডকভার)', 'This is a good book', '1552387831_1509.jpg', 'গোলাম মাওলা রনি', '225', '0', 'অনন্যা', '2019-03-12 10:50:31', NULL),
(28, 21, 'শ্রেষ্ঠ উপন্যাস (হার্ডকভার)', '\r\nসৈয়দ শামসুল হক\r\n\r\nজন্ম : ২৭ ডিসেম্বর, ১৯৩৫, জন্মস্থান: কুড়িগ্রাম, বাংলাদেশ, পিতা : ডা. সৈয়দ সিদ্দিক হুসাইন, মাতা : সৈয়দা হালিমা খাতুন, শিক্ষাজীবন : কুড়িগ্রাম ও ঢাকা মানবিক শাখা, বিজ্ঞান শাখা এবং ইংরেজি ভাষা সাহিত্য। পেশা : লেখা, প্রিয় : বই ও ভ্রমণ, গ্রন্থসংখ্যা : কবিতা, গল্প, উপন্যাস, কাব্যনাট্য, প্রবন্ধ, শিশুসাহিত্য মিলে দু’শতাধিক।পুরস্কার : বাংলা একাডেমি সাহিত্য পুরস্কার, সমগ্র সাহিত্যকর্মের জন্য বাংলাদেশের প্রধান সব পুরস্কার এবং রাষ্ট্রীয় একুশে পদক এবং স্বাধীনতা পুরস্কার।', '1552388114_2251.jpg', 'সৈয়দ শামসুল হক', '510', '0', ' অনন্যা', '2019-03-12 10:55:14', NULL),
(29, 21, ' ধিতাং ধিতাং', '\r\nলুৎফর রহমান রিটন\r\n\r\nLutfur Rahman Reton\r\nপুরনো ঢাকার ওয়ারী এলাকায় তার শৈশব অতিবাহিত হয়। ১৯৭৯ খ্রিস্টাব্দে নবাবপুর সরকারি উচ্চ বিদ্যালয় থেকে এসএসসি ও ১৯৮১ খ্রিস্টাব্দে এইচএসসি পরীক্ষা দেন। ঢাকা বিশ্ববিদ্যালয়ের অধীনে ১৯৮৯ খ্রিস্টাব্দে আবুজর গিফারি কলেজ থেকে স্নাতক শেষ করেন।', '1552388292_4812.jpg', 'লুৎফর রহমান রিটন', '90', '0', ' অনন্যা', '2019-03-12 10:58:12', NULL),
(30, 21, 'নির্বাচিত ভূতের গল্প (হার্ডকভার)', 'হুমায়ূন আহমেদের পছন্দের কিছু ভূতের গল্প এই গ্রন্থে একত্রিত করা হয়েছে। ভূত বিষয়ে লেখকদের একটি লেখার অংশ বিশেষ উদ্ধৃত করা হচ্ছে-এ থেকে ভূত প্রসঙ্গে লেখকের মনোভাব বোঝা যাবে-\r\n”মিসির আলি সাহেব যদি জিজ্ঞাসা করা হয়-”আপনি ভূত বিশ্বাস করেন?” তিনি তৎক্ষণাৎ বলবেন-”না। যুক্তিতে ভূত আসে না।”\r\nহিমুকে এই প্রশ্ন করলে, হিমু বলবে-”অবশ্যই ভূত বিশ্বাস করি। যু্ক্তি শেষ কথা নয়-জগতের অনেক রহস্যই যুক্তির বাইরে।”', '1552388479_3154.jpg', 'হুমায়ূন আহমেদ', '255', '0', 'অনন্যা', '2019-03-12 11:01:19', NULL),
(31, 21, 'কারাগারের রোজনামচা (হার্ডকভার', '&#039;কারাগারের রোজনামচা&#039; বইয়ের ফ্ল্যাপে লেখা কথা\r\n\r\nভাষা আন্দোলন থেকে ধাপে ধাপে স্বাধীনতা অর্জনের সোপানগুলি যে কত বন্ধুর পথ অতিক্রম করে এগুতে হয়েছে তার কিছুটা এই কারাগারের রোজনামচা বই থেকে পাওয়া যাবে। স্বাধীন বাংলাদেশ ও স্বাধীন জাতি হিসেবে মর্যাদা বাঙালি পেয়েছে যে সংগ্রামের মধ্য দিয়ে, সেই সংগ্রামে অনেক ব্যথা-বেদনা, অশ্রু ও রক্তের ইতিহাস রয়েছে। মহান ত্যাগের মধ্য দিয়ে মহৎ অর্জন করে দিয়ে গেছেন জাতির পিতা বঙ্গবন্ধু শেখ মুজিবুর রহমান । ', '1552388831_4292.jpg', 'শেখ মুজিবুর রহমান', '400', '0', 'বাংলা একাডেমি', '2019-03-12 11:07:11', NULL),
(32, 21, 'বুদ্ধিমান ছেলে (হার্ডকভার)', '\r\nআনিসুল হক\r\n\r\nআনিসুল হক - আনিসুল হক (জন্ম: মার্চ ৪, ১৯৬৫) একজন বাংলাদেশী কবি, লেখক, নাট্যকার ও সাংবাদিক। বর্তমানে তিনি বাংলাদেশের দৈনিক প্রথম আলোর সহযোগী সম্পাদক এবং কিশোর আলোর সম্পাদক প', '1552389110_1345.jpg', ' আনিসুল হক', '113', '0', 'ইতি প্রকাশন', '2019-03-12 11:11:50', NULL),
(33, 21, 'ঘোড়ার ডিম (হার্ডকভার)', '\r\nআনিসুল হক\r\n\r\nআনিসুল হক - আনিসুল হক (জন্ম: মার্চ ৪, ১৯৬৫) একজন বাংলাদেশী কবি, লেখক, নাট্যকার ও সাংবাদিক। বর্তমানে তিনি বাংলাদেশের দৈনিক প্রথম আলোর সহযোগী সম্পাদক', '1552389300_3552.jpg', 'আনিসুল হক', '120', '0', 'ইতি প্রকাশন', '2019-03-12 11:15:00', NULL),
(34, 21, 'ভাল্লাগে না (হার্ডকভার)', '‘ভাল্লাগে না’ বইয়ের ফ্ল্যাপের কথাঃ\r\nবাংলাদেশের সবচেয়ে বড় অনলাইন স্কুল, 10 Minute School-এর প্রতিষ্ঠাতা আয়মান সাদিক। 10 Minute School-এ প্রতিদিন আড়াই লাখেরও বেশি শিক্ষার্থী বিনা মূল্যে পড়াশানো করছে।', '1552389437_1124.jpg', 'আয়মান সাদিক ,  অন্তিক মাহমুদ', '225', '0', ' আদর্শ', '2019-03-12 11:17:17', NULL),
(35, 21, 'একটা দেশ যেভাবে দাঁড়ায় (হার্ডকভার)', 'No comment', '1552389531_2876.jpg', 'রউফুল আলম', '250', '0', 'সমগ্র প্রকাশন', '2019-03-12 11:18:51', NULL),
(36, 21, 'অ্যাডভান্সড জাভা প্রোগ্রামিং (পেপারব্যাক)', 'ভূমিকা\r\nবিশ্বব্যাপী তথ্যপ্রযুক্তির জগতে জাভা একটি শক্তিশালী প্রোগ্রামিং ভাষা হিসেবে সুপ্রতিষ্ঠিত। শিক্ষাপ্রতিষ্ঠান থেকে শুরু করে মোবাইল ফোন, ওয়েব ও এন্টারপ্রাইজ সফটওয়্যার তৈরির জন্য জাভা খুবই জনপ্রিয়। তাই জাভার অগ্রসর বিষয়গুলো নিয়ে একটি নতুন বই বাংলা ভাষায় তথ্যপ্রযুক্তি শিক্ষার প্রসারে একটি অনন্য সংযোজন।', '1552389661_2337.jpg', 'আ ন ম বজলুর রহমান', '360', '0', 'দ্বিমিক প্রকাশনী', '2019-03-12 11:21:01', NULL),
(37, 21, 'ঘুরে দাঁড়াও', 'ঘুরে দাঁড়াও বইটি পর্ন-আসক্তি থেকে মুক্তিলাভের প্রেসক্রিপশন। তবে এই বইয়ের নির্দেশনাগুলো মেনে চলতে পারলে শুধু আসক্তি থেকে মুক্তিলাভ করবেন এমন নয়, আপনি সত্যিকার অর্থেই একজন আত্মপ্রত্যয়ী সফল মানুষ হতে পারবেন।', '1552389761_4385.jpg', 'ওয়ায়েল ইব্রাহিম', '260', '0', 'ওয়াফি পাবলিকেশন', '2019-03-12 11:22:41', NULL),
(38, 21, 'লাভ স্টোরি (হার্ডকভার)', 'Customers who bought this product also bought', '1552389881_1746.jpg', ' আর জে উদয়', '150', '0', 'স্টুডেন্ট ওয়েজ', '2019-03-12 11:24:41', NULL),
(39, 21, 'অংশু (পেপারব্যাক)', '‘অংশু’ অর্থ কিরণ। কিরণ মানে আলো, আলোকচ্ছটা। এই লেখাটা হয়ত সত্যিকারের অংশু নয়। তবে সত্যিকারের অংশুকে তুলে ধরার ‘নাকাম’ প্রচেষ্টা একে বলা যেতে পারে। তবে এই ‘টুটাফুটা’ লেখাতেও যদি কেউ অংশুর দেখা পান! তবেই এই লেখার সার্থকতা।', '1552391098_4457.jpg', ' হোসাইন শাকিল', '138', '0', 'সমর্পণ প্রকাশন', '2019-03-12 11:44:58', NULL),
(40, 21, 'ভোরের রং কালো (হার্ডকভার)', 'মশিউর রহমান শান্ত\r\n\r\nমশিউর রহমান শান্ত`র মিডিয়ায় পথচলা শুরু ২০১০ সালে একুশে টেলিভিশনে মুক্ত খবরে রিপোর্টার এবং প্রেজেন্টার হিসেবে যোগদানের মধ্য দিয়ে। শিশুতোষ রিপোর্ট ', '1552391303_4007.jpg', 'মশিউর রহমান শান্ত', '203', '0', 'পাঞ্জেরী পাবলিকেশন', '2019-03-12 11:48:23', NULL),
(41, 21, 'হিফয ছাত্রদের তথ্য বই (শুধু মাত্র মাদ্রাসার জন্য) (Paperback)', 'বেফাকুল মাদারিসিল আরাবিয়া বাংলাদেশ', '1552391566_4442.jpg', 'বেফাকুল মাদারিসিল আরাবিয়া বাংলাদেশ', '225', '0', 'বেফাকুল মাদারিসিল আরাবিয়া বাংলাদেশ', '2019-03-12 11:52:46', NULL),
(42, 21, 'এইচ এস সি ইংলিশ -২য় পত্র= পানি (পেপারব্যাক)', '\r\nমোহাম্মদ মনিরুজ্জামান মিয়া', '1552391708_3767.jpg', 'মোহাম্মদ মনিরুজ্জামান মিয়া', '308', '0', ' সাইফুর’স', '2019-03-12 11:55:08', NULL),
(43, 21, 'English For Today : For Classes 11-12 (Paperback)', '\r\nDr. Muhammad Shahidullah\r\n\r\nDr. Muhammad Shahidullah\r\nভারতীয় উপমহাদেশের একজন স্মরণীয় বাঙালি ব্যক্তিত্ব, বহুভাষাবিদ, বিশিষ্ট শিক্ষক ও দার্শনিক ছিলেন। তিনি ভারতের পশ্চিমবঙ্গের অবিভক্ত চব্বিশ পরগণা জেলার পেয়ারা গ্রামে ১০ জুলাই ১৮৮৫ সালে জন্মগ্রহণ করেন।', '1552391782_2427.jpg', 'Dr. Muhammad Shahidullah', '93', '0', ' NCTB', '2019-03-12 11:56:22', NULL),
(44, 21, 'পদার্থবিজ্ঞান-১ম পত্র (একাদশ-দ্বাদশ শ্রেণি) (সাদা)', 'ড. শাহজাহান তপন', '1552391883_3010.jpg', ' ড. শাহজাহান তপন , মুহম্মদ আজিজ হাসান , ড. রানা চৌধুরী', '260', '0', ' হাসান বুক হাউস', '2019-03-12 11:58:03', NULL),
(45, 21, 'জ্যামিতির সব বিখ্যাত সমস্যা ও সমাধান', '* অধ্যায়-১ : প্রাচীন গ্রিকদের অর্জন\r\n* অধ্যায়-২ : গঠনযোগ্যতার একটি বিশ্লেষণী মানদনণ্ড\r\n* অধ্যায়-৩ : জটিল সংখ্যা\r\n* অধ্যায়-৪ : ডেলিয়ান সমস্যা', '1552391970_2965.jpg', 'বেঞ্জামিন বোল্ড', '160', '0', ' সময় প্রকাশন', '2019-03-12 11:59:30', NULL),
(46, 21, 'জীববিজ্ঞান-১ম পত্র (একাদশ-দ্বাদশ শ্রেণি) (সাদা)', '\r\nড. মোহাম্মদ আবুল হাসান', '1552392080_3671.jpg', ' ড. মোহাম্মদ আবুল হাসান', '250', '0', ' হাসান বুক হাউস', '2019-03-12 12:01:20', NULL),
(47, 21, 'পদার্থবিজ্ঞান-১ম পত্র (একাদশ-দ্বাদশ শ্রেণি)(সাদা)', '\r\nড. আমির হোসেন খান', '1552392208_2173.jpg', ' ড. আমির হোসেন খান , প্রফেসর মোহাম্মদ ইস্‌হাক', '380', '0', ' আইডিয়াল বুকস', '2019-03-12 12:03:28', NULL),
(48, 21, 'অসমাপ্ত আত্মজীবনী(সুলভ) (পেপারব্যাক)', 'শেখ মুজিবুর রহমানের লেখা চারটি খাতা ২০০৪ সালে আকস্মিকভাবে তাঁর কন্যা শেখ হাসিনার হস্তগত হয়। খাতাগুলি অতি পুরানো, পাতাগুলি জীর্ণপ্রায় এবং লেখা প্রায়শ অস্পষ্ট', '1552392474_1090.jpg', 'অসমাপ্ত আত্মজীবনী(সুলভ) (পেপারব্যাক)', '160', '0', 'দি ইউনিভার্সিটি প্রেস লিমিটেড(ইউ পি এল)', '2019-03-12 12:07:54', NULL),
(49, 21, 'লক্ষ প্রাণের বিনিময়ে', 'ফ্ল্যাপে লিখা কথা\r\n\r\n`লক্ষ প্রাণের বিনিময়ে’ ১৯৭১-এ বাংলাদেশের মুক্তিযুদ্ধের শ্বাসরুদ্ধের ঘটনার বর্ণনায় সমৃদ্ধ এক ঐতিহাসিক দলিল। গ্রন্থে একদিকে যেমন মুক্তিযুদ্ধের অনিশ্চিত, দুঃস্বপ্নের ন’মাসের রক্তাক্ত যুদ্ধসমূহের বিবরণ স্থান পেয়েছে', '1552392595_3828.jpg', 'রফিকুল ইসলাম বীর উত্তম', '460', '0', ' অনন্যা', '2019-03-12 12:09:55', NULL),
(50, 21, 'শেষ চিঠি (হুমায়ুন আহমেদের মুত্যুর পরে তাকে উদ্দেশ্য করে লেখা তার মায়ের চিঠি) (হার্ডকভার)', '‘শেষ চিঠি’ বইয়ের ফ্ল্যাপের কথাঃ\r\n\r\n‘শেষ চিঠি’ আয়েশা ফয়েজের শেষ বই। আগে ‘জীবন যে রকম’ নামে তিনি একটি বই লিখেছিলেন। আমেরিকায় বসে, যেটি তাঁর লেখার পনেরো বছর পর প্রকাশিত হয়। দ্বিতীয় এই বইটি তাঁর মৃত্যুর দুই বছর পরই প্রকাশিত হলো। ', '1552393033_2827.jpg', ' আয়েশা ফয়েজ', '150', '0', ' তাম্রলিপি', '2019-03-12 12:17:13', NULL),
(51, 21, 'দ্য বিট্রেয়াল অভ ইস্ট পাকিস্তান (হার্ডকভার)', 'ফ্ল্যাপে লিখা কথা\r\n\r\nইস্টার্ন কমান্ডের লেফটেন্যান্ট জেনারেল এ.এ.কে. নিয়াজি হলেন সেই ব্যক্তি যাকে এমন এক দুর্ভাগ্যজনক অপারেশনের নেতৃত্ব দিতে হয়েছিল যার ফলে পাকিস্তানের বিভক্তি ঘটেছে', '1552393187_2628.jpg', ' লে.জে.এ.এ.কে.নিয়াজী', '340', '0', 'আফসার ব্রাদার্স', '2019-03-12 12:19:47', NULL),
(52, 21, 'আগুনের ডানা (উইংগস অফ ফায়ার অবলম্বনে) (হার্ডকভার)', 'আসিফ রশীদ,আসিফ রশীদ,আসিফ রশীদ', '1552393323_3636.jpg', ' আসিফ রশীদ', '72', '0', ' সময় প্রকাশন', '2019-03-12 12:22:03', NULL),
(53, 21, 'মুহাম্মদ : মহানবীর (স:) জীবনী', '\r\nশওকত হোসেন\r\n\r\nশওকত হােসেনের আদি নিবাস চট্টগ্রাম চাকরির সুবাদে বাল্য এবং কৈশোর কেটেছে দেশের বিভিন্ন শহরে। বই পড়ার অদম্য নেশা পেয়েছেন বইপ্ৰেমী মায়ের কাছ থেকে ।', '1552393405_1699.jpg', 'ক্যারেন আর্মস্ট্রং', '350', '0', ' শওকত হোসেন', '2019-03-12 12:23:25', NULL),
(54, 21, 'দ্য পিরামিড (ম্যান বুকার পুরস্কার) (হার্ডকভার)', '\r\nরাফিক হারিরি\r\n\r\nRafiq Hariri\r\nরফিক হারিরি কাজ করছেন ছোটগল্প ও উপন্যাস নিয়ে। শিশু সাহিত্যের প্রতি রয়েছে প্রবল ঝোক । সাহিত্যের বিশ্বায়ন বা বিশ্ব সাহিত্যের প্রতি আগ্রহ নিয়ে কাজ শুরু করেছেন অনুবাদে।', '1552393546_2713.jpg', ' ইসমাঈল কাদরী', '150', '0', 'রোদেলা প্রকাশনী', '2019-03-12 12:25:46', NULL),
(55, 21, 'ক্ষমতা (পুরস্কারপ্রাপ্ত লেখকদের বই) (হার্ডকভার)', 'আরশাদ আজিজ.আরশাদ আজিজ.আরশাদ আজিজ', '1552393646_2849.jpg', ' বারট্রান্ড রাসেল', '250', '0', ' আরশাদ আজিজ', '2019-03-12 12:27:26', NULL),
(56, 21, 'হলুদ বসন্ত (আনন্দ সাহিত্য পুরস্কার) (হার্ডকভার)', '‘ফোনটা বাজছিল’ বইয়ের কিছু কথাঃ\r\n\r\nফোনটা বাজছিল।\r\nঅন্য প্রান্তে ফোনটা কুরর- কুর কুরর- কুর করে কোনও মেঘলা দুপুরের কামাতুরা কবুতরের কথার মতো বাজছিল। শুনতে পাচ্ছিলাম।', '1552393754_2465.jpg', ' বুদ্ধদেব গুহ', '290', '0', ' আনন্দ পাবলিশার্স (ভারত)', '2019-03-12 12:29:14', NULL),
(57, 24, 'Computer123', 'wa we fweg fwe rweaeaR  werfw2 ar fwe rwear tfvweraf wa we fweg fwe rweaeaR  werfw2 ar fwe rwear tfvweraf wa we fweg fwe rweaeaR  werfw2 ar fwe rw', '1553579014_4989.jpg', 'হুমায়ন আহম্মেদ', '250', '0', 'রবি পাবলিকেসন্স', '2019-03-26 05:42:05', NULL),
(58, 23, 'Computer', 'dsfsda sadfsdfsda saefse sadfgsdf sadf sdfsdf sdfs dsdf', '1553579926_2372.jpg', '120', '200', '0', 'dsfsd', '2019-03-26 05:58:46', NULL),
(59, 24, 'afwer', 'sdzf ggggggggggew gear gaE GGWEA ', '1553596431_3744.jpg', 'asfwef', '120', '0', 'asfweaf', '2019-03-26 10:33:52', NULL),
(60, 24, 'SADFWE FWASDF ', 'ASE FCFWERTF GWERA  WEAFWTA', '1553596542_3935.jpg', 'ASf FWSAF  FW ', '150', '0', 'AFWEW AFRWEA F FWE', '2019-03-26 10:35:42', NULL),
(61, 24, 'ASFWE FWED', 'ASf FWEAWEA FWEA WEA RFAd Q', '1553596629_4958.jpg', 'AFSW FSA', '1200', '0', 'AFSW FWEA ', '2019-03-26 10:37:09', NULL),
(62, 24, 'ed cr fwe fwd  fwerweaF', 'fa weeeeeee ', '1553596717_2494.jpg', 'afw fdas fc fwef', '150', '0', 'asf faw', '2019-03-26 10:38:37', NULL),
(63, 22, 'ersatf ewar', 'safwe fsadf sae ffsdaf fw  fwe w vwef we', '1553596780_1060.jpg', 'রবিন্দ্রনাথ ঠাকুর', '150', '0', 'গার্ডিয়ান পাবলিকেশন', '2019-03-26 10:39:40', NULL),
(65, 24, ' e t ved gverdfg erdfg', 'sea gggggetf  bvvtfg ergee gev gesz  ', '1553601103_2913.jpg', 'faw rwrfersrf ', '111', '0', 'erwat tesr  gtas gt', '2019-03-26 11:51:43', NULL),
(66, 24, 'w rffrwerw ear', 'awFD fcwasaefwea fwesaf  ffae  fwe w fwe rwef waEF A fvwe', '1553601219_3129.jpg', 'asef wfwe w', '456', '0', 'fadwe rf waed fcsdfcwe a', '2019-03-26 11:53:39', NULL),
(67, 22, 'rfwewe rweaRr ', 'we rfweee faer fsa afsadfwe ffweweAS fwsdfw', '1553601265_1406.jpg', 'রবিন্দ্রনাথ ঠাকুর', '200', '0', 'safc fwewaedwerwra', '2019-03-26 11:54:25', NULL),
(68, 24, 'erstrdtgrds', 'ghhhhhhhhhhhhhhhj gc gyjuu gcgjhgv ', '1553601459_3098.jpg', 'fghfgchgfxc', '788', '0', 'jhbvkggh', '2019-03-26 11:57:39', NULL),
(69, 22, '5eryrdgdf', 'dfgdr dzrtfgzxdg  zrdtgfdxxz  rtgrsdtg rtgrsfg fdgdfg fdgfdsg', '1553601569_4256.jpg', 'fgrfgdfgdsdfdsfdx', '125', '0', 'fddgdfgddfgd', '2019-03-26 11:59:29', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `books_category`
--

CREATE TABLE `books_category` (
  `Id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `books_id` int(11) NOT NULL,
  `category_id` int(11) NOT NULL,
  `created` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `books_category`
--

INSERT INTO `books_category` (`Id`, `user_id`, `books_id`, `category_id`, `created`) VALUES
(109, 3, 19, 15, '2019-03-12 16:05:56'),
(110, 3, 20, 16, '2019-03-12 16:06:06'),
(111, 3, 21, 16, '2019-03-12 16:06:18'),
(112, 3, 22, 17, '2019-03-12 16:06:25'),
(113, 0, 22, 18, '2019-03-12 16:06:29'),
(114, 0, 23, 19, '2019-03-12 16:06:33'),
(115, 0, 23, 19, '2019-03-12 16:06:38'),
(116, 0, 24, 20, '2019-03-12 16:06:42'),
(117, 0, 25, 15, '2019-03-12 16:06:50'),
(118, 0, 57, 19, '2019-03-26 05:42:05'),
(119, 0, 57, 20, '2019-03-26 05:42:05'),
(120, 0, 58, 14, '2019-03-26 05:58:46'),
(121, 0, 58, 21, '2019-03-26 05:58:46'),
(122, 0, 58, 22, '2019-03-26 05:58:46'),
(123, 0, 59, 15, '2019-03-26 10:33:52'),
(124, 0, 59, 16, '2019-03-26 10:33:52'),
(125, 0, 60, 15, '2019-03-26 10:35:42'),
(126, 0, 61, 14, '2019-03-26 10:37:09'),
(127, 0, 62, 13, '2019-03-26 10:38:37'),
(128, 0, 63, 14, '2019-03-26 10:39:40'),
(129, 0, 63, 15, '2019-03-26 10:39:40'),
(130, 0, 64, 14, '2019-03-26 11:49:58'),
(131, 0, 64, 15, '2019-03-26 11:49:58'),
(132, 0, 64, 16, '2019-03-26 11:49:58'),
(133, 0, 65, 14, '2019-03-26 11:51:43'),
(134, 0, 65, 15, '2019-03-26 11:51:43'),
(135, 0, 66, 14, '2019-03-26 11:53:39'),
(136, 0, 66, 15, '2019-03-26 11:53:39'),
(137, 0, 67, 13, '2019-03-26 11:54:25'),
(138, 0, 67, 14, '2019-03-26 11:54:25'),
(139, 0, 68, 15, '2019-03-26 11:57:39'),
(140, 0, 69, 16, '2019-03-26 11:59:29');

-- --------------------------------------------------------

--
-- Table structure for table `category`
--

CREATE TABLE `category` (
  `id` int(11) NOT NULL,
  `name` varchar(60) COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_id` int(11) NOT NULL,
  `created` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `category`
--

INSERT INTO `category` (`id`, `name`, `user_id`, `created`) VALUES
(13, 'All Catrgory', 3, '2019-03-12 22:02:18'),
(14, 'Primary', 3, '2019-03-12 22:02:35'),
(15, 'Highschool', 3, '2019-03-12 22:02:46'),
(16, 'University', 3, '2019-03-12 22:03:24'),
(17, 'National', 3, '2019-03-12 22:03:59'),
(18, 'madrasah', 3, '2019-03-12 22:04:10'),
(19, 'উপন্যাস', 3, '2019-03-12 22:04:20'),
(20, 'কবিতার বই', 3, '2019-03-12 22:04:34'),
(21, 'ছোট গল্প', 3, '2019-03-12 22:04:48'),
(22, 'ইসলামিক বই', 3, '2019-03-12 22:05:00'),
(23, 'Banglaseh', 3, '2019-03-12 22:05:10');

-- --------------------------------------------------------

--
-- Table structure for table `comments`
--

CREATE TABLE `comments` (
  `id` int(11) NOT NULL,
  `comment_book_id` int(11) NOT NULL,
  `com_name` varchar(60) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email_phone` varchar(160) COLLATE utf8mb4_unicode_ci NOT NULL,
  `comment_details` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `created` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `comments`
--

INSERT INTO `comments` (`id`, `comment_book_id`, `com_name`, `email_phone`, `comment_details`, `created`) VALUES
(1, 25, 'zahid', '0155522222222', 'helllo ami azdjkdsfisd', '2019-03-11 03:49:40'),
(2, 22, 'zahid islam', '01555222', 'dsfsdfds  agdsfsdf adsfgdfsdfd', '2019-03-11 11:56:57'),
(3, 2, 'tanzir', '456465465464646468', 'sdfsdafdsfsdfsdfsdfds', '2019-03-11 11:58:51'),
(4, 3, 'aadkjfsdkjfksdjkfjsdkf', 'dsafwsedafesdafdsa', 'sdafdsafdsfsdfsdfsdfdsf', '2019-03-11 12:00:57'),
(5, 2, 'tanzirjdlksadfjsikdjlsjfsdjfisdifs', '456465465464646468', 'sdfsdafdsfsdfsdfsdfdsdsfasdafsedafsdaafsdafcdsdsfds', '2019-03-11 11:58:51'),
(6, 25, 'helllo', 'hisdjkfsdjfj', 'dsfdsafsdfsd', '2019-03-11 12:34:23'),
(7, 25, 'zahiddkddkd', '55522522222', 'vaki ah vijdsjds', '2019-03-12 09:14:23'),
(8, 25, 'adsfsarfwasf', 'sdfsdfsdafsda', 'sdfsadfsadfsadfsdfsad', '2019-03-12 09:15:37'),
(9, 68, 'zahidul', '', 'ami ki kinte par bo', '2019-03-27 03:19:16');

-- --------------------------------------------------------

--
-- Table structure for table `districts`
--

CREATE TABLE `districts` (
  `id` int(2) UNSIGNED NOT NULL,
  `division_id` int(2) UNSIGNED NOT NULL,
  `name` varchar(30) NOT NULL,
  `bn_name` varchar(50) NOT NULL,
  `lat` double NOT NULL,
  `lon` double NOT NULL,
  `website` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `districts`
--

INSERT INTO `districts` (`id`, `division_id`, `name`, `bn_name`, `lat`, `lon`, `website`) VALUES
(1, 3, 'Dhaka', 'ঢাকা', 23.7115253, 90.4111451, 'www.dhaka.gov.bd'),
(2, 3, 'Faridpur', 'ফরিদপুর', 23.6070822, 89.8429406, 'www.faridpur.gov.bd'),
(3, 3, 'Gazipur', 'গাজীপুর', 24.0022858, 90.4264283, 'www.gazipur.gov.bd'),
(4, 3, 'Gopalganj', 'গোপালগঞ্জ', 23.0050857, 89.8266059, 'www.gopalganj.gov.bd'),
(5, 8, 'Jamalpur', 'জামালপুর', 24.937533, 89.937775, 'www.jamalpur.gov.bd'),
(6, 3, 'Kishoreganj', 'কিশোরগঞ্জ', 24.444937, 90.776575, 'www.kishoreganj.gov.bd'),
(7, 3, 'Madaripur', 'মাদারীপুর', 23.164102, 90.1896805, 'www.madaripur.gov.bd'),
(8, 3, 'Manikganj', 'মানিকগঞ্জ', 0, 0, 'www.manikganj.gov.bd'),
(9, 3, 'Munshiganj', 'মুন্সিগঞ্জ', 0, 0, 'www.munshiganj.gov.bd'),
(10, 8, 'Mymensingh', 'ময়মনসিংহ', 0, 0, 'www.mymensingh.gov.bd'),
(11, 3, 'Narayanganj', 'নারায়াণগঞ্জ', 23.63366, 90.496482, 'www.narayanganj.gov.bd'),
(12, 3, 'Narsingdi', 'নরসিংদী', 23.932233, 90.71541, 'www.narsingdi.gov.bd'),
(13, 8, 'Netrokona', 'নেত্রকোণা', 24.870955, 90.727887, 'www.netrokona.gov.bd'),
(14, 3, 'Rajbari', 'রাজবাড়ি', 23.7574305, 89.6444665, 'www.rajbari.gov.bd'),
(15, 3, 'Shariatpur', 'শরীয়তপুর', 0, 0, 'www.shariatpur.gov.bd'),
(16, 8, 'Sherpur', 'শেরপুর', 25.0204933, 90.0152966, 'www.sherpur.gov.bd'),
(17, 3, 'Tangail', 'টাঙ্গাইল', 0, 0, 'www.tangail.gov.bd'),
(18, 5, 'Bogura', 'বগুড়া', 24.8465228, 89.377755, 'www.bogra.gov.bd'),
(19, 5, 'Joypurhat', 'জয়পুরহাট', 0, 0, 'www.joypurhat.gov.bd'),
(20, 5, 'Naogaon', 'নওগাঁ', 0, 0, 'www.naogaon.gov.bd'),
(21, 5, 'Natore', 'নাটোর', 24.420556, 89.000282, 'www.natore.gov.bd'),
(22, 5, 'Nawabganj', 'নবাবগঞ্জ', 24.5965034, 88.2775122, 'www.chapainawabganj.gov.bd'),
(23, 5, 'Pabna', 'পাবনা', 23.998524, 89.233645, 'www.pabna.gov.bd'),
(24, 5, 'Rajshahi', 'রাজশাহী', 0, 0, 'www.rajshahi.gov.bd'),
(25, 5, 'Sirajgonj', 'সিরাজগঞ্জ', 24.4533978, 89.7006815, 'www.sirajganj.gov.bd'),
(26, 6, 'Dinajpur', 'দিনাজপুর', 25.6217061, 88.6354504, 'www.dinajpur.gov.bd'),
(27, 6, 'Gaibandha', 'গাইবান্ধা', 25.328751, 89.528088, 'www.gaibandha.gov.bd'),
(28, 6, 'Kurigram', 'কুড়িগ্রাম', 25.805445, 89.636174, 'www.kurigram.gov.bd'),
(29, 6, 'Lalmonirhat', 'লালমনিরহাট', 0, 0, 'www.lalmonirhat.gov.bd'),
(30, 6, 'Nilphamari', 'নীলফামারী', 25.931794, 88.856006, 'www.nilphamari.gov.bd'),
(31, 6, 'Panchagarh', 'পঞ্চগড়', 26.3411, 88.5541606, 'www.panchagarh.gov.bd'),
(32, 6, 'Rangpur', 'রংপুর', 25.7558096, 89.244462, 'www.rangpur.gov.bd'),
(33, 6, 'Thakurgaon', 'ঠাকুরগাঁও', 26.0336945, 88.4616834, 'www.thakurgaon.gov.bd'),
(34, 1, 'Barguna', 'বরগুনা', 0, 0, 'www.barguna.gov.bd'),
(35, 1, 'Barishal', 'বরিশাল', 0, 0, 'www.barisal.gov.bd'),
(36, 1, 'Bhola', 'ভোলা', 22.685923, 90.648179, 'www.bhola.gov.bd'),
(37, 1, 'Jhalokati', 'ঝালকাঠি', 0, 0, 'www.jhalakathi.gov.bd'),
(38, 1, 'Patuakhali', 'পটুয়াখালী', 22.3596316, 90.3298712, 'www.patuakhali.gov.bd'),
(39, 1, 'Pirojpur', 'পিরোজপুর', 0, 0, 'www.pirojpur.gov.bd'),
(40, 2, 'Bandarban', 'বান্দরবান', 22.1953275, 92.2183773, 'www.bandarban.gov.bd'),
(41, 2, 'Brahmanbaria', 'ব্রাহ্মণবাড়িয়া', 23.9570904, 91.1119286, 'www.brahmanbaria.gov.bd'),
(42, 2, 'Chandpur', 'চাঁদপুর', 23.2332585, 90.6712912, 'www.chandpur.gov.bd'),
(43, 2, 'Chattogram', 'চট্টগ্রাম', 22.335109, 91.834073, 'www.chittagong.gov.bd'),
(44, 2, 'Cumilla', 'কুমিল্লা', 23.4682747, 91.1788135, 'www.comilla.gov.bd'),
(45, 2, 'Cox\'s Bazar', 'কক্স বাজার', 0, 0, 'www.coxsbazar.gov.bd'),
(46, 2, 'Feni', 'ফেনী', 23.023231, 91.3840844, 'www.feni.gov.bd'),
(47, 2, 'Khagrachari', 'খাগড়াছড়ি', 23.119285, 91.984663, 'www.khagrachhari.gov.bd'),
(48, 2, 'Lakshmipur', 'লক্ষ্মীপুর', 22.942477, 90.841184, 'www.lakshmipur.gov.bd'),
(49, 2, 'Noakhali', 'নোয়াখালী', 22.869563, 91.099398, 'www.noakhali.gov.bd'),
(50, 2, 'Rangamati', 'রাঙ্গামাটি', 0, 0, 'www.rangamati.gov.bd'),
(51, 7, 'Habiganj', 'হবিগঞ্জ', 24.374945, 91.41553, 'www.habiganj.gov.bd'),
(52, 7, 'Maulvibazar', 'মৌলভীবাজার', 24.482934, 91.777417, 'www.moulvibazar.gov.bd'),
(53, 7, 'Sunamganj', 'সুনামগঞ্জ', 25.0658042, 91.3950115, 'www.sunamganj.gov.bd'),
(54, 7, 'Sylhet', 'সিলেট', 24.8897956, 91.8697894, 'www.sylhet.gov.bd'),
(55, 4, 'Bagerhat', 'বাগেরহাট', 22.651568, 89.785938, 'www.bagerhat.gov.bd'),
(56, 4, 'Chuadanga', 'চুয়াডাঙ্গা', 23.6401961, 88.841841, 'www.chuadanga.gov.bd'),
(57, 4, 'Jashore', 'যশোর', 23.16643, 89.2081126, 'www.jessore.gov.bd'),
(58, 4, 'Jhenaidah', 'ঝিনাইদহ', 23.5448176, 89.1539213, 'www.jhenaidah.gov.bd'),
(59, 4, 'Khulna', 'খুলনা', 22.815774, 89.568679, 'www.khulna.gov.bd'),
(60, 4, 'Kushtia', 'কুষ্টিয়া', 23.901258, 89.120482, 'www.kushtia.gov.bd'),
(61, 4, 'Magura', 'মাগুরা', 23.487337, 89.419956, 'www.magura.gov.bd'),
(62, 4, 'Meherpur', 'মেহেরপুর', 23.762213, 88.631821, 'www.meherpur.gov.bd'),
(63, 4, 'Narail', 'নড়াইল', 23.172534, 89.512672, 'www.narail.gov.bd'),
(64, 4, 'Satkhira', 'সাতক্ষীরা', 0, 0, 'www.satkhira.gov.bd');

-- --------------------------------------------------------

--
-- Table structure for table `divisions`
--

CREATE TABLE `divisions` (
  `id` int(2) UNSIGNED NOT NULL,
  `name` varchar(30) NOT NULL,
  `bn_name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `divisions`
--

INSERT INTO `divisions` (`id`, `name`, `bn_name`) VALUES
(1, 'Barishal', 'বরিশাল'),
(2, 'Chattogram', 'চট্টগ্রাম'),
(3, 'Dhaka', 'ঢাকা'),
(4, 'Khulna', 'খুলনা'),
(5, 'Rajshahi', 'রাজশাহী'),
(6, 'Rangpur', 'রংপুর'),
(7, 'Sylhet', 'সিলেট'),
(8, 'Mymensingh', 'ময়মনসিংহ');

-- --------------------------------------------------------

--
-- Table structure for table `group_name`
--

CREATE TABLE `group_name` (
  `id` int(11) NOT NULL,
  `group_name` varchar(300) COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_id` varchar(60) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `images`
--

CREATE TABLE `images` (
  `id` int(11) NOT NULL,
  `imagesname` varchar(60) COLLATE utf8mb4_unicode_ci NOT NULL,
  `book_id` int(11) NOT NULL,
  `user_id` varchar(60) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `profile`
--

CREATE TABLE `profile` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `bod` varchar(11) COLLATE utf8mb4_unicode_ci NOT NULL,
  `gender` varchar(11) COLLATE utf8mb4_unicode_ci NOT NULL,
  `country` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `divisions` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `districs` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `upazilas` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `profile`
--

INSERT INTO `profile` (`id`, `user_id`, `bod`, `gender`, `country`, `divisions`, `districs`, `upazilas`, `created`) VALUES
(15, 20, '2019-02-23', 'female', 'Banglaseh', 'Dhaka', 'Gazipur', 'Patharghata Upazila', 0),
(16, 2, '2019-02-28', 'female', 'Banglaseh', 'Khulna', 'Sherpur', 'Wazirpur Upazila', 0),
(20, 3, '2019-02-16', 'male', 'Banglaseh', 'Mymensingh', 'Tangail', 'danura', 0),
(22, 19, '2019-02-28', 'male', 'Banglaseh', 'dhala', 'Shariatpur', 'Natore', 0),
(23, 1, '2019-02-08', 'female', 'Banglaseh', 'Khulna', 'Manikganj', 'Patharghata Upazila', 0),
(24, 22, '2019-03-08', 'male', 'Banglaseh', 'Chattogram', 'Tangail', 'Bhola Sadar Upazila', 0),
(25, 24, '2019-03-22', 'female', 'Banglaseh', 'Chattogram', 'Joypurhat', 'Bhola Sadar Upazila', 0);

-- --------------------------------------------------------

--
-- Table structure for table `sessions`
--

CREATE TABLE `sessions` (
  `session_id` varchar(40) COLLATE utf8_bin NOT NULL DEFAULT '0',
  `ip_address` varchar(16) COLLATE utf8_bin NOT NULL DEFAULT '0',
  `user_agent` varchar(120) COLLATE utf8_bin DEFAULT NULL,
  `last_activity` int(10) UNSIGNED NOT NULL DEFAULT '0',
  `user_data` text COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- --------------------------------------------------------

--
-- Table structure for table `upazilas`
--

CREATE TABLE `upazilas` (
  `id` int(2) UNSIGNED NOT NULL,
  `district_id` int(2) UNSIGNED NOT NULL,
  `name` varchar(30) NOT NULL,
  `bn_name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `upazilas`
--

INSERT INTO `upazilas` (`id`, `district_id`, `name`, `bn_name`) VALUES
(1, 34, 'Amtali Upazila', 'আমতলী'),
(2, 34, 'Bamna Upazila', 'বামনা'),
(3, 34, 'Barguna Sadar Upazila', 'বরগুনা সদর'),
(4, 34, 'Betagi Upazila', 'বেতাগি'),
(5, 34, 'Patharghata Upazila', 'পাথরঘাটা'),
(6, 34, 'Taltali Upazila', 'তালতলী'),
(7, 35, 'Muladi Upazila', 'মুলাদি'),
(8, 35, 'Babuganj Upazila', 'বাবুগঞ্জ'),
(9, 35, 'Agailjhara Upazila', 'আগাইলঝরা'),
(10, 35, 'Barisal Sadar Upazila', 'বরিশাল সদর'),
(11, 35, 'Bakerganj Upazila', 'বাকেরগঞ্জ'),
(12, 35, 'Banaripara Upazila', 'বানাড়িপারা'),
(13, 35, 'Gaurnadi Upazila', 'গৌরনদী'),
(14, 35, 'Hizla Upazila', 'হিজলা'),
(15, 35, 'Mehendiganj Upazila', 'মেহেদিগঞ্জ '),
(16, 35, 'Wazirpur Upazila', 'ওয়াজিরপুর'),
(17, 36, 'Bhola Sadar Upazila', 'ভোলা সদর'),
(18, 36, 'Burhanuddin Upazila', 'বুরহানউদ্দিন'),
(19, 36, 'Char Fasson Upazila', 'চর ফ্যাশন'),
(20, 36, 'Daulatkhan Upazila', 'দৌলতখান'),
(21, 36, 'Lalmohan Upazila', 'লালমোহন'),
(22, 36, 'Manpura Upazila', 'মনপুরা'),
(23, 36, 'Tazumuddin Upazila', 'তাজুমুদ্দিন'),
(24, 37, 'Jhalokati Sadar Upazila', 'ঝালকাঠি সদর'),
(25, 37, 'Kathalia Upazila', 'কাঁঠালিয়া'),
(26, 37, 'Nalchity Upazila', 'নালচিতি'),
(27, 37, 'Rajapur Upazila', 'রাজাপুর'),
(28, 38, 'Bauphal Upazila', 'বাউফল'),
(29, 38, 'Dashmina Upazila', 'দশমিনা'),
(30, 38, 'Galachipa Upazila', 'গলাচিপা'),
(31, 38, 'Kalapara Upazila', 'কালাপারা'),
(32, 38, 'Mirzaganj Upazila', 'মির্জাগঞ্জ '),
(33, 38, 'Patuakhali Sadar Upazila', 'পটুয়াখালী সদর'),
(34, 38, 'Dumki Upazila', 'ডুমকি'),
(35, 38, 'Rangabali Upazila', 'রাঙ্গাবালি'),
(36, 39, 'Bhandaria', 'ভ্যান্ডারিয়া'),
(37, 39, 'Kaukhali', 'কাউখালি'),
(38, 39, 'Mathbaria', 'মাঠবাড়িয়া'),
(39, 39, 'Nazirpur', 'নাজিরপুর'),
(40, 39, 'Nesarabad', 'নেসারাবাদ'),
(41, 39, 'Pirojpur Sadar', 'পিরোজপুর সদর'),
(42, 39, 'Zianagar', 'জিয়ানগর'),
(43, 40, 'Bandarban Sadar', 'বান্দরবন সদর'),
(44, 40, 'Thanchi', 'থানচি'),
(45, 40, 'Lama', 'লামা'),
(46, 40, 'Naikhongchhari', 'নাইখংছড়ি '),
(47, 40, 'Ali kadam', 'আলী কদম'),
(48, 40, 'Rowangchhari', 'রউয়াংছড়ি '),
(49, 40, 'Ruma', 'রুমা'),
(50, 41, 'Brahmanbaria Sadar Upazila', 'ব্রাহ্মণবাড়িয়া সদর'),
(51, 41, 'Ashuganj Upazila', 'আশুগঞ্জ'),
(52, 41, 'Nasirnagar Upazila', 'নাসির নগর'),
(53, 41, 'Nabinagar Upazila', 'নবীনগর'),
(54, 41, 'Sarail Upazila', 'সরাইল'),
(55, 41, 'Shahbazpur Town', 'শাহবাজপুর টাউন'),
(56, 41, 'Kasba Upazila', 'কসবা'),
(57, 41, 'Akhaura Upazila', 'আখাউরা'),
(58, 41, 'Bancharampur Upazila', 'বাঞ্ছারামপুর'),
(59, 41, 'Bijoynagar Upazila', 'বিজয় নগর'),
(60, 42, 'Chandpur Sadar', 'চাঁদপুর সদর'),
(61, 42, 'Faridganj', 'ফরিদগঞ্জ'),
(62, 42, 'Haimchar', 'হাইমচর'),
(63, 42, 'Haziganj', 'হাজীগঞ্জ'),
(64, 42, 'Kachua', 'কচুয়া'),
(65, 42, 'Matlab Uttar', 'মতলব উত্তর'),
(66, 42, 'Matlab Dakkhin', 'মতলব দক্ষিণ'),
(67, 42, 'Shahrasti', 'শাহরাস্তি'),
(68, 43, 'Anwara Upazila', 'আনোয়ারা'),
(69, 43, 'Banshkhali Upazila', 'বাশখালি'),
(70, 43, 'Boalkhali Upazila', 'বোয়ালখালি'),
(71, 43, 'Chandanaish Upazila', 'চন্দনাইশ'),
(72, 43, 'Fatikchhari Upazila', 'ফটিকছড়ি'),
(73, 43, 'Hathazari Upazila', 'হাঠহাজারী'),
(74, 43, 'Lohagara Upazila', 'লোহাগারা'),
(75, 43, 'Mirsharai Upazila', 'মিরসরাই'),
(76, 43, 'Patiya Upazila', 'পটিয়া'),
(77, 43, 'Rangunia Upazila', 'রাঙ্গুনিয়া'),
(78, 43, 'Raozan Upazila', 'রাউজান'),
(79, 43, 'Sandwip Upazila', 'সন্দ্বীপ'),
(80, 43, 'Satkania Upazila', 'সাতকানিয়া'),
(81, 43, 'Sitakunda Upazila', 'সীতাকুণ্ড'),
(82, 44, 'Barura Upazila', 'বড়ুরা'),
(83, 44, 'Brahmanpara Upazila', 'ব্রাহ্মণপাড়া'),
(84, 44, 'Burichong Upazila', 'বুড়িচং'),
(85, 44, 'Chandina Upazila', 'চান্দিনা'),
(86, 44, 'Chauddagram Upazila', 'চৌদ্দগ্রাম'),
(87, 44, 'Daudkandi Upazila', 'দাউদকান্দি'),
(88, 44, 'Debidwar Upazila', 'দেবীদ্বার'),
(89, 44, 'Homna Upazila', 'হোমনা'),
(90, 44, 'Comilla Sadar Upazila', 'কুমিল্লা সদর'),
(91, 44, 'Laksam Upazila', 'লাকসাম'),
(92, 44, 'Monohorgonj Upazila', 'মনোহরগঞ্জ'),
(93, 44, 'Meghna Upazila', 'মেঘনা'),
(94, 44, 'Muradnagar Upazila', 'মুরাদনগর'),
(95, 44, 'Nangalkot Upazila', 'নাঙ্গালকোট'),
(96, 44, 'Comilla Sadar South Upazila', 'কুমিল্লা সদর দক্ষিণ'),
(97, 44, 'Titas Upazila', 'তিতাস'),
(98, 45, 'Chakaria Upazila', 'চকরিয়া'),
(100, 45, 'Cox\'s Bazar Sadar Upazila', 'কক্স বাজার সদর'),
(101, 45, 'Kutubdia Upazila', 'কুতুবদিয়া'),
(102, 45, 'Maheshkhali Upazila', 'মহেশখালী'),
(103, 45, 'Ramu Upazila', 'রামু'),
(104, 45, 'Teknaf Upazila', 'টেকনাফ'),
(105, 45, 'Ukhia Upazila', 'উখিয়া'),
(106, 45, 'Pekua Upazila', 'পেকুয়া'),
(107, 46, 'Feni Sadar', 'ফেনী সদর'),
(108, 46, 'Chagalnaiya', 'ছাগল নাইয়া'),
(109, 46, 'Daganbhyan', 'দাগানভিয়া'),
(110, 46, 'Parshuram', 'পরশুরাম'),
(111, 46, 'Fhulgazi', 'ফুলগাজি'),
(112, 46, 'Sonagazi', 'সোনাগাজি'),
(113, 47, 'Dighinala Upazila', 'দিঘিনালা '),
(114, 47, 'Khagrachhari Upazila', 'খাগড়াছড়ি'),
(115, 47, 'Lakshmichhari Upazila', 'লক্ষ্মীছড়ি'),
(116, 47, 'Mahalchhari Upazila', 'মহলছড়ি'),
(117, 47, 'Manikchhari Upazila', 'মানিকছড়ি'),
(118, 47, 'Matiranga Upazila', 'মাটিরাঙ্গা'),
(119, 47, 'Panchhari Upazila', 'পানছড়ি'),
(120, 47, 'Ramgarh Upazila', 'রামগড়'),
(121, 48, 'Lakshmipur Sadar Upazila', 'লক্ষ্মীপুর সদর'),
(122, 48, 'Raipur Upazila', 'রায়পুর'),
(123, 48, 'Ramganj Upazila', 'রামগঞ্জ'),
(124, 48, 'Ramgati Upazila', 'রামগতি'),
(125, 48, 'Komol Nagar Upazila', 'কমল নগর'),
(126, 49, 'Noakhali Sadar Upazila', 'নোয়াখালী সদর'),
(127, 49, 'Begumganj Upazila', 'বেগমগঞ্জ'),
(128, 49, 'Chatkhil Upazila', 'চাটখিল'),
(129, 49, 'Companyganj Upazila', 'কোম্পানীগঞ্জ'),
(130, 49, 'Shenbag Upazila', 'শেনবাগ'),
(131, 49, 'Hatia Upazila', 'হাতিয়া'),
(132, 49, 'Kobirhat Upazila', 'কবিরহাট '),
(133, 49, 'Sonaimuri Upazila', 'সোনাইমুরি'),
(134, 49, 'Suborno Char Upazila', 'সুবর্ণ চর '),
(135, 50, 'Rangamati Sadar Upazila', 'রাঙ্গামাটি সদর'),
(136, 50, 'Belaichhari Upazila', 'বেলাইছড়ি'),
(137, 50, 'Bagaichhari Upazila', 'বাঘাইছড়ি'),
(138, 50, 'Barkal Upazila', 'বরকল'),
(139, 50, 'Juraichhari Upazila', 'জুরাইছড়ি'),
(140, 50, 'Rajasthali Upazila', 'রাজাস্থলি'),
(141, 50, 'Kaptai Upazila', 'কাপ্তাই'),
(142, 50, 'Langadu Upazila', 'লাঙ্গাডু'),
(143, 50, 'Nannerchar Upazila', 'নান্নেরচর '),
(144, 50, 'Kaukhali Upazila', 'কাউখালি'),
(145, 1, 'Dhamrai Upazila', 'ধামরাই'),
(146, 1, 'Dohar Upazila', 'দোহার'),
(147, 1, 'Keraniganj Upazila', 'কেরানীগঞ্জ'),
(148, 1, 'Nawabganj Upazila', 'নবাবগঞ্জ'),
(149, 1, 'Savar Upazila', 'সাভার'),
(150, 2, 'Faridpur Sadar Upazila', 'ফরিদপুর সদর'),
(151, 2, 'Boalmari Upazila', 'বোয়ালমারী'),
(152, 2, 'Alfadanga Upazila', 'আলফাডাঙ্গা'),
(153, 2, 'Madhukhali Upazila', 'মধুখালি'),
(154, 2, 'Bhanga Upazila', 'ভাঙ্গা'),
(155, 2, 'Nagarkanda Upazila', 'নগরকান্ড'),
(156, 2, 'Charbhadrasan Upazila', 'চরভদ্রাসন '),
(157, 2, 'Sadarpur Upazila', 'সদরপুর'),
(158, 2, 'Shaltha Upazila', 'শালথা'),
(159, 3, 'Gazipur Sadar-Joydebpur', 'গাজীপুর সদর'),
(160, 3, 'Kaliakior', 'কালিয়াকৈর'),
(161, 3, 'Kapasia', 'কাপাসিয়া'),
(162, 3, 'Sripur', 'শ্রীপুর'),
(163, 3, 'Kaliganj', 'কালীগঞ্জ'),
(164, 3, 'Tongi', 'টঙ্গি'),
(165, 4, 'Gopalganj Sadar Upazila', 'গোপালগঞ্জ সদর'),
(166, 4, 'Kashiani Upazila', 'কাশিয়ানি'),
(167, 4, 'Kotalipara Upazila', 'কোটালিপাড়া'),
(168, 4, 'Muksudpur Upazila', 'মুকসুদপুর'),
(169, 4, 'Tungipara Upazila', 'টুঙ্গিপাড়া'),
(170, 5, 'Dewanganj Upazila', 'দেওয়ানগঞ্জ'),
(171, 5, 'Baksiganj Upazila', 'বকসিগঞ্জ'),
(172, 5, 'Islampur Upazila', 'ইসলামপুর'),
(173, 5, 'Jamalpur Sadar Upazila', 'জামালপুর সদর'),
(174, 5, 'Madarganj Upazila', 'মাদারগঞ্জ'),
(175, 5, 'Melandaha Upazila', 'মেলানদাহা'),
(176, 5, 'Sarishabari Upazila', 'সরিষাবাড়ি '),
(177, 5, 'Narundi Police I.C', 'নারুন্দি'),
(178, 6, 'Astagram Upazila', 'অষ্টগ্রাম'),
(179, 6, 'Bajitpur Upazila', 'বাজিতপুর'),
(180, 6, 'Bhairab Upazila', 'ভৈরব'),
(181, 6, 'Hossainpur Upazila', 'হোসেনপুর '),
(182, 6, 'Itna Upazila', 'ইটনা'),
(183, 6, 'Karimganj Upazila', 'করিমগঞ্জ'),
(184, 6, 'Katiadi Upazila', 'কতিয়াদি'),
(185, 6, 'Kishoreganj Sadar Upazila', 'কিশোরগঞ্জ সদর'),
(186, 6, 'Kuliarchar Upazila', 'কুলিয়ারচর'),
(187, 6, 'Mithamain Upazila', 'মিঠামাইন'),
(188, 6, 'Nikli Upazila', 'নিকলি'),
(189, 6, 'Pakundia Upazila', 'পাকুন্ডা'),
(190, 6, 'Tarail Upazila', 'তাড়াইল'),
(191, 7, 'Madaripur Sadar', 'মাদারীপুর সদর'),
(192, 7, 'Kalkini', 'কালকিনি'),
(193, 7, 'Rajoir', 'রাজইর'),
(194, 7, 'Shibchar', 'শিবচর'),
(195, 8, 'Manikganj Sadar Upazila', 'মানিকগঞ্জ সদর'),
(196, 8, 'Singair Upazila', 'সিঙ্গাইর'),
(197, 8, 'Shibalaya Upazila', 'শিবালয়'),
(198, 8, 'Saturia Upazila', 'সাঠুরিয়া'),
(199, 8, 'Harirampur Upazila', 'হরিরামপুর'),
(200, 8, 'Ghior Upazila', 'ঘিওর'),
(201, 8, 'Daulatpur Upazila', 'দৌলতপুর'),
(202, 9, 'Lohajang Upazila', 'লোহাজং'),
(203, 9, 'Sreenagar Upazila', 'শ্রীনগর'),
(204, 9, 'Munshiganj Sadar Upazila', 'মুন্সিগঞ্জ সদর'),
(205, 9, 'Sirajdikhan Upazila', 'সিরাজদিখান'),
(206, 9, 'Tongibari Upazila', 'টঙ্গিবাড়ি'),
(207, 9, 'Gazaria Upazila', 'গজারিয়া'),
(208, 10, 'Bhaluka', 'ভালুকা'),
(209, 10, 'Trishal', 'ত্রিশাল'),
(210, 10, 'Haluaghat', 'হালুয়াঘাট'),
(211, 10, 'Muktagachha', 'মুক্তাগাছা'),
(212, 10, 'Dhobaura', 'ধবারুয়া'),
(213, 10, 'Fulbaria', 'ফুলবাড়িয়া'),
(214, 10, 'Gaffargaon', 'গফরগাঁও'),
(215, 10, 'Gauripur', 'গৌরিপুর'),
(216, 10, 'Ishwarganj', 'ঈশ্বরগঞ্জ'),
(217, 10, 'Mymensingh Sadar', 'ময়মনসিং সদর'),
(218, 10, 'Nandail', 'নন্দাইল'),
(219, 10, 'Phulpur', 'ফুলপুর'),
(220, 11, 'Araihazar Upazila', 'আড়াইহাজার'),
(221, 11, 'Sonargaon Upazila', 'সোনারগাঁও'),
(222, 11, 'Bandar', 'বান্দার'),
(223, 11, 'Naryanganj Sadar Upazila', 'নারায়ানগঞ্জ সদর'),
(224, 11, 'Rupganj Upazila', 'রূপগঞ্জ'),
(225, 11, 'Siddirgonj Upazila', 'সিদ্ধিরগঞ্জ'),
(226, 12, 'Belabo Upazila', 'বেলাবো'),
(227, 12, 'Monohardi Upazila', 'মনোহরদি'),
(228, 12, 'Narsingdi Sadar Upazila', 'নরসিংদী সদর'),
(229, 12, 'Palash Upazila', 'পলাশ'),
(230, 12, 'Raipura Upazila, Narsingdi', 'রায়পুর'),
(231, 12, 'Shibpur Upazila', 'শিবপুর'),
(232, 13, 'Kendua Upazilla', 'কেন্দুয়া'),
(233, 13, 'Atpara Upazilla', 'আটপাড়া'),
(234, 13, 'Barhatta Upazilla', 'বরহাট্টা'),
(235, 13, 'Durgapur Upazilla', 'দুর্গাপুর'),
(236, 13, 'Kalmakanda Upazilla', 'কলমাকান্দা'),
(237, 13, 'Madan Upazilla', 'মদন'),
(238, 13, 'Mohanganj Upazilla', 'মোহনগঞ্জ'),
(239, 13, 'Netrakona-S Upazilla', 'নেত্রকোনা সদর'),
(240, 13, 'Purbadhala Upazilla', 'পূর্বধলা'),
(241, 13, 'Khaliajuri Upazilla', 'খালিয়াজুরি'),
(242, 14, 'Baliakandi Upazila', 'বালিয়াকান্দি'),
(243, 14, 'Goalandaghat Upazila', 'গোয়ালন্দ ঘাট'),
(244, 14, 'Pangsha Upazila', 'পাংশা'),
(245, 14, 'Kalukhali Upazila', 'কালুখালি'),
(246, 14, 'Rajbari Sadar Upazila', 'রাজবাড়ি সদর'),
(247, 15, 'Shariatpur Sadar -Palong', 'শরীয়তপুর সদর '),
(248, 15, 'Damudya Upazila', 'দামুদিয়া'),
(249, 15, 'Naria Upazila', 'নড়িয়া'),
(250, 15, 'Jajira Upazila', 'জাজিরা'),
(251, 15, 'Bhedarganj Upazila', 'ভেদারগঞ্জ'),
(252, 15, 'Gosairhat Upazila', 'গোসাইর হাট '),
(253, 16, 'Jhenaigati Upazila', 'ঝিনাইগাতি'),
(254, 16, 'Nakla Upazila', 'নাকলা'),
(255, 16, 'Nalitabari Upazila', 'নালিতাবাড়ি'),
(256, 16, 'Sherpur Sadar Upazila', 'শেরপুর সদর'),
(257, 16, 'Sreebardi Upazila', 'শ্রীবরদি'),
(258, 17, 'Tangail Sadar Upazila', 'টাঙ্গাইল সদর'),
(259, 17, 'Sakhipur Upazila', 'সখিপুর'),
(260, 17, 'Basail Upazila', 'বসাইল'),
(261, 17, 'Madhupur Upazila', 'মধুপুর'),
(262, 17, 'Ghatail Upazila', 'ঘাটাইল'),
(263, 17, 'Kalihati Upazila', 'কালিহাতি'),
(264, 17, 'Nagarpur Upazila', 'নগরপুর'),
(265, 17, 'Mirzapur Upazila', 'মির্জাপুর'),
(266, 17, 'Gopalpur Upazila', 'গোপালপুর'),
(267, 17, 'Delduar Upazila', 'দেলদুয়ার'),
(268, 17, 'Bhuapur Upazila', 'ভুয়াপুর'),
(269, 17, 'Dhanbari Upazila', 'ধানবাড়ি'),
(270, 55, 'Bagerhat Sadar Upazila', 'বাগেরহাট সদর'),
(271, 55, 'Chitalmari Upazila', 'চিতলমাড়ি'),
(272, 55, 'Fakirhat Upazila', 'ফকিরহাট'),
(273, 55, 'Kachua Upazila', 'কচুয়া'),
(274, 55, 'Mollahat Upazila', 'মোল্লাহাট '),
(275, 55, 'Mongla Upazila', 'মংলা'),
(276, 55, 'Morrelganj Upazila', 'মরেলগঞ্জ'),
(277, 55, 'Rampal Upazila', 'রামপাল'),
(278, 55, 'Sarankhola Upazila', 'স্মরণখোলা'),
(279, 56, 'Damurhuda Upazila', 'দামুরহুদা'),
(280, 56, 'Chuadanga-S Upazila', 'চুয়াডাঙ্গা সদর'),
(281, 56, 'Jibannagar Upazila', 'জীবন নগর '),
(282, 56, 'Alamdanga Upazila', 'আলমডাঙ্গা'),
(283, 57, 'Abhaynagar Upazila', 'অভয়নগর'),
(284, 57, 'Keshabpur Upazila', 'কেশবপুর'),
(285, 57, 'Bagherpara Upazila', 'বাঘের পাড়া '),
(286, 57, 'Jessore Sadar Upazila', 'যশোর সদর'),
(287, 57, 'Chaugachha Upazila', 'চৌগাছা'),
(288, 57, 'Manirampur Upazila', 'মনিরামপুর '),
(289, 57, 'Jhikargachha Upazila', 'ঝিকরগাছা'),
(290, 57, 'Sharsha Upazila', 'সারশা'),
(291, 58, 'Jhenaidah Sadar Upazila', 'ঝিনাইদহ সদর'),
(292, 58, 'Maheshpur Upazila', 'মহেশপুর'),
(293, 58, 'Kaliganj Upazila', 'কালীগঞ্জ'),
(294, 58, 'Kotchandpur Upazila', 'কোট চাঁদপুর '),
(295, 58, 'Shailkupa Upazila', 'শৈলকুপা'),
(296, 58, 'Harinakunda Upazila', 'হাড়িনাকুন্দা'),
(297, 59, 'Terokhada Upazila', 'তেরোখাদা'),
(298, 59, 'Batiaghata Upazila', 'বাটিয়াঘাটা '),
(299, 59, 'Dacope Upazila', 'ডাকপে'),
(300, 59, 'Dumuria Upazila', 'ডুমুরিয়া'),
(301, 59, 'Dighalia Upazila', 'দিঘলিয়া'),
(302, 59, 'Koyra Upazila', 'কয়ড়া'),
(303, 59, 'Paikgachha Upazila', 'পাইকগাছা'),
(304, 59, 'Phultala Upazila', 'ফুলতলা'),
(305, 59, 'Rupsa Upazila', 'রূপসা'),
(306, 60, 'Kushtia Sadar', 'কুষ্টিয়া সদর'),
(307, 60, 'Kumarkhali', 'কুমারখালি'),
(308, 60, 'Daulatpur', 'দৌলতপুর'),
(309, 60, 'Mirpur', 'মিরপুর'),
(310, 60, 'Bheramara', 'ভেরামারা'),
(311, 60, 'Khoksa', 'খোকসা'),
(312, 61, 'Magura Sadar Upazila', 'মাগুরা সদর'),
(313, 61, 'Mohammadpur Upazila', 'মোহাম্মাদপুর'),
(314, 61, 'Shalikha Upazila', 'শালিখা'),
(315, 61, 'Sreepur Upazila', 'শ্রীপুর'),
(316, 62, 'angni Upazila', 'আংনি'),
(317, 62, 'Mujib Nagar Upazila', 'মুজিব নগর'),
(318, 62, 'Meherpur-S Upazila', 'মেহেরপুর সদর'),
(319, 63, 'Narail-S Upazilla', 'নড়াইল সদর'),
(320, 63, 'Lohagara Upazilla', 'লোহাগাড়া'),
(321, 63, 'Kalia Upazilla', 'কালিয়া'),
(322, 64, 'Satkhira Sadar Upazila', 'সাতক্ষীরা সদর'),
(323, 64, 'Assasuni Upazila', 'আসসাশুনি '),
(324, 64, 'Debhata Upazila', 'দেভাটা'),
(325, 64, 'Tala Upazila', 'তালা'),
(326, 64, 'Kalaroa Upazila', 'কলরোয়া'),
(327, 64, 'Kaliganj Upazila', 'কালীগঞ্জ'),
(328, 64, 'Shyamnagar Upazila', 'শ্যামনগর'),
(329, 18, 'Adamdighi', 'আদমদিঘী'),
(330, 18, 'Bogra Sadar', 'বগুড়া সদর'),
(331, 18, 'Sherpur', 'শেরপুর'),
(332, 18, 'Dhunat', 'ধুনট'),
(333, 18, 'Dhupchanchia', 'দুপচাচিয়া'),
(334, 18, 'Gabtali', 'গাবতলি'),
(335, 18, 'Kahaloo', 'কাহালু'),
(336, 18, 'Nandigram', 'নন্দিগ্রাম'),
(337, 18, 'Sahajanpur', 'শাহজাহানপুর'),
(338, 18, 'Sariakandi', 'সারিয়াকান্দি'),
(339, 18, 'Shibganj', 'শিবগঞ্জ'),
(340, 18, 'Sonatala', 'সোনাতলা'),
(341, 19, 'Joypurhat S', 'জয়পুরহাট সদর'),
(342, 19, 'Akkelpur', 'আক্কেলপুর'),
(343, 19, 'Kalai', 'কালাই'),
(344, 19, 'Khetlal', 'খেতলাল'),
(345, 19, 'Panchbibi', 'পাঁচবিবি'),
(346, 20, 'Naogaon Sadar Upazila', 'নওগাঁ সদর'),
(347, 20, 'Mohadevpur Upazila', 'মহাদেবপুর'),
(348, 20, 'Manda Upazila', 'মান্দা'),
(349, 20, 'Niamatpur Upazila', 'নিয়ামতপুর'),
(350, 20, 'Atrai Upazila', 'আত্রাই'),
(351, 20, 'Raninagar Upazila', 'রাণীনগর'),
(352, 20, 'Patnitala Upazila', 'পত্নীতলা'),
(353, 20, 'Dhamoirhat Upazila', 'ধামইরহাট '),
(354, 20, 'Sapahar Upazila', 'সাপাহার'),
(355, 20, 'Porsha Upazila', 'পোরশা'),
(356, 20, 'Badalgachhi Upazila', 'বদলগাছি'),
(357, 21, 'Natore Sadar Upazila', 'নাটোর সদর'),
(358, 21, 'Baraigram Upazila', 'বড়াইগ্রাম'),
(359, 21, 'Bagatipara Upazila', 'বাগাতিপাড়া'),
(360, 21, 'Lalpur Upazila', 'লালপুর'),
(361, 21, 'Natore Sadar Upazila', 'নাটোর সদর'),
(362, 21, 'Baraigram Upazila', 'বড়াই গ্রাম'),
(363, 22, 'Bholahat Upazila', 'ভোলাহাট'),
(364, 22, 'Gomastapur Upazila', 'গোমস্তাপুর'),
(365, 22, 'Nachole Upazila', 'নাচোল'),
(366, 22, 'Nawabganj Sadar Upazila', 'নবাবগঞ্জ সদর'),
(367, 22, 'Shibganj Upazila', 'শিবগঞ্জ'),
(368, 23, 'Atgharia Upazila', 'আটঘরিয়া'),
(369, 23, 'Bera Upazila', 'বেড়া'),
(370, 23, 'Bhangura Upazila', 'ভাঙ্গুরা'),
(371, 23, 'Chatmohar Upazila', 'চাটমোহর'),
(372, 23, 'Faridpur Upazila', 'ফরিদপুর'),
(373, 23, 'Ishwardi Upazila', 'ঈশ্বরদী'),
(374, 23, 'Pabna Sadar Upazila', 'পাবনা সদর'),
(375, 23, 'Santhia Upazila', 'সাথিয়া'),
(376, 23, 'Sujanagar Upazila', 'সুজানগর'),
(377, 24, 'Bagha', 'বাঘা'),
(378, 24, 'Bagmara', 'বাগমারা'),
(379, 24, 'Charghat', 'চারঘাট'),
(380, 24, 'Durgapur', 'দুর্গাপুর'),
(381, 24, 'Godagari', 'গোদাগারি'),
(382, 24, 'Mohanpur', 'মোহনপুর'),
(383, 24, 'Paba', 'পবা'),
(384, 24, 'Puthia', 'পুঠিয়া'),
(385, 24, 'Tanore', 'তানোর'),
(386, 25, 'Sirajganj Sadar Upazila', 'সিরাজগঞ্জ সদর'),
(387, 25, 'Belkuchi Upazila', 'বেলকুচি'),
(388, 25, 'Chauhali Upazila', 'চৌহালি'),
(389, 25, 'Kamarkhanda Upazila', 'কামারখান্দা'),
(390, 25, 'Kazipur Upazila', 'কাজীপুর'),
(391, 25, 'Raiganj Upazila', 'রায়গঞ্জ'),
(392, 25, 'Shahjadpur Upazila', 'শাহজাদপুর'),
(393, 25, 'Tarash Upazila', 'তারাশ'),
(394, 25, 'Ullahpara Upazila', 'উল্লাপাড়া'),
(395, 26, 'Birampur Upazila', 'বিরামপুর'),
(396, 26, 'Birganj', 'বীরগঞ্জ'),
(397, 26, 'Biral Upazila', 'বিড়াল'),
(398, 26, 'Bochaganj Upazila', 'বোচাগঞ্জ'),
(399, 26, 'Chirirbandar Upazila', 'চিরিরবন্দর'),
(400, 26, 'Phulbari Upazila', 'ফুলবাড়ি'),
(401, 26, 'Ghoraghat Upazila', 'ঘোড়াঘাট'),
(402, 26, 'Hakimpur Upazila', 'হাকিমপুর'),
(403, 26, 'Kaharole Upazila', 'কাহারোল'),
(404, 26, 'Khansama Upazila', 'খানসামা'),
(405, 26, 'Dinajpur Sadar Upazila', 'দিনাজপুর সদর'),
(406, 26, 'Nawabganj', 'নবাবগঞ্জ'),
(407, 26, 'Parbatipur Upazila', 'পার্বতীপুর'),
(408, 27, 'Fulchhari', 'ফুলছড়ি'),
(409, 27, 'Gaibandha sadar', 'গাইবান্ধা সদর'),
(410, 27, 'Gobindaganj', 'গোবিন্দগঞ্জ'),
(411, 27, 'Palashbari', 'পলাশবাড়ী'),
(412, 27, 'Sadullapur', 'সাদুল্যাপুর'),
(413, 27, 'Saghata', 'সাঘাটা'),
(414, 27, 'Sundarganj', 'সুন্দরগঞ্জ'),
(415, 28, 'Kurigram Sadar', 'কুড়িগ্রাম সদর'),
(416, 28, 'Nageshwari', 'নাগেশ্বরী'),
(417, 28, 'Bhurungamari', 'ভুরুঙ্গামারি'),
(418, 28, 'Phulbari', 'ফুলবাড়ি'),
(419, 28, 'Rajarhat', 'রাজারহাট'),
(420, 28, 'Ulipur', 'উলিপুর'),
(421, 28, 'Chilmari', 'চিলমারি'),
(422, 28, 'Rowmari', 'রউমারি'),
(423, 28, 'Char Rajibpur', 'চর রাজিবপুর'),
(424, 29, 'Lalmanirhat Sadar', 'লালমনিরহাট সদর'),
(425, 29, 'Aditmari', 'আদিতমারি'),
(426, 29, 'Kaliganj', 'কালীগঞ্জ'),
(427, 29, 'Hatibandha', 'হাতিবান্ধা'),
(428, 29, 'Patgram', 'পাটগ্রাম'),
(429, 30, 'Nilphamari Sadar', 'নীলফামারী সদর'),
(430, 30, 'Saidpur', 'সৈয়দপুর'),
(431, 30, 'Jaldhaka', 'জলঢাকা'),
(432, 30, 'Kishoreganj', 'কিশোরগঞ্জ'),
(433, 30, 'Domar', 'ডোমার'),
(434, 30, 'Dimla', 'ডিমলা'),
(435, 31, 'Panchagarh Sadar', 'পঞ্চগড় সদর'),
(436, 31, 'Debiganj', 'দেবীগঞ্জ'),
(437, 31, 'Boda', 'বোদা'),
(438, 31, 'Atwari', 'আটোয়ারি'),
(439, 31, 'Tetulia', 'তেতুলিয়া'),
(440, 32, 'Badarganj', 'বদরগঞ্জ'),
(441, 32, 'Mithapukur', 'মিঠাপুকুর'),
(442, 32, 'Gangachara', 'গঙ্গাচরা'),
(443, 32, 'Kaunia', 'কাউনিয়া'),
(444, 32, 'Rangpur Sadar', 'রংপুর সদর'),
(445, 32, 'Pirgachha', 'পীরগাছা'),
(446, 32, 'Pirganj', 'পীরগঞ্জ'),
(447, 32, 'Taraganj', 'তারাগঞ্জ'),
(448, 33, 'Thakurgaon Sadar Upazila', 'ঠাকুরগাঁও সদর'),
(449, 33, 'Pirganj Upazila', 'পীরগঞ্জ'),
(450, 33, 'Baliadangi Upazila', 'বালিয়াডাঙ্গি'),
(451, 33, 'Haripur Upazila', 'হরিপুর'),
(452, 33, 'Ranisankail Upazila', 'রাণীসংকইল'),
(453, 51, 'Ajmiriganj', 'আজমিরিগঞ্জ'),
(454, 51, 'Baniachang', 'বানিয়াচং'),
(455, 51, 'Bahubal', 'বাহুবল'),
(456, 51, 'Chunarughat', 'চুনারুঘাট'),
(457, 51, 'Habiganj Sadar', 'হবিগঞ্জ সদর'),
(458, 51, 'Lakhai', 'লাক্ষাই'),
(459, 51, 'Madhabpur', 'মাধবপুর'),
(460, 51, 'Nabiganj', 'নবীগঞ্জ'),
(461, 51, 'Shaistagonj Upazila', 'শায়েস্তাগঞ্জ'),
(462, 52, 'Moulvibazar Sadar', 'মৌলভীবাজার'),
(463, 52, 'Barlekha', 'বড়লেখা'),
(464, 52, 'Juri', 'জুড়ি'),
(465, 52, 'Kamalganj', 'কামালগঞ্জ'),
(466, 52, 'Kulaura', 'কুলাউরা'),
(467, 52, 'Rajnagar', 'রাজনগর'),
(468, 52, 'Sreemangal', 'শ্রীমঙ্গল'),
(469, 53, 'Bishwamvarpur', 'বিসশম্ভারপুর'),
(470, 53, 'Chhatak', 'ছাতক'),
(471, 53, 'Derai', 'দেড়াই'),
(472, 53, 'Dharampasha', 'ধরমপাশা'),
(473, 53, 'Dowarabazar', 'দোয়ারাবাজার'),
(474, 53, 'Jagannathpur', 'জগন্নাথপুর'),
(475, 53, 'Jamalganj', 'জামালগঞ্জ'),
(476, 53, 'Sulla', 'সুল্লা'),
(477, 53, 'Sunamganj Sadar', 'সুনামগঞ্জ সদর'),
(478, 53, 'Shanthiganj', 'শান্তিগঞ্জ'),
(479, 53, 'Tahirpur', 'তাহিরপুর'),
(480, 54, 'Sylhet Sadar', 'সিলেট সদর'),
(481, 54, 'Beanibazar', 'বেয়ানিবাজার'),
(482, 54, 'Bishwanath', 'বিশ্বনাথ'),
(483, 54, 'Dakshin Surma Upazila', 'দক্ষিণ সুরমা'),
(484, 54, 'Balaganj', 'বালাগঞ্জ'),
(485, 54, 'Companiganj', 'কোম্পানিগঞ্জ'),
(486, 54, 'Fenchuganj', 'ফেঞ্চুগঞ্জ'),
(487, 54, 'Golapganj', 'গোলাপগঞ্জ'),
(488, 54, 'Gowainghat', 'গোয়াইনঘাট'),
(489, 54, 'Jaintiapur', 'জয়ন্তপুর'),
(490, 54, 'Kanaighat', 'কানাইঘাট'),
(491, 54, 'Zakiganj', 'জাকিগঞ্জ'),
(492, 54, 'Nobigonj', 'নবীগঞ্জ');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `user_id` int(11) NOT NULL,
  `username` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `imagename` varchar(60) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(200) COLLATE utf8mb4_unicode_ci NOT NULL,
  `mobile` int(30) NOT NULL,
  `pass` varchar(60) COLLATE utf8mb4_unicode_ci NOT NULL,
  `forgot_password` int(11) DEFAULT NULL,
  `role` set('1','2','3') COLLATE utf8mb4_unicode_ci NOT NULL,
  `created` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`user_id`, `username`, `imagename`, `email`, `mobile`, `pass`, `forgot_password`, `role`, `created`, `updated`) VALUES
(3, 'Zahidul', 'zahidul.jpg', 'mjahid1990@gmail.com', 1739898764, '$2y$10$rayyQiYCxQFn3mLNYNCkUuhKS7945E1nJdClfjt7q/QqMh4wDJ8h6', 0, '1', '2019-01-02 21:52:06', NULL),
(20, 'himu', '1551096115_3733.jpg', 'himu299089@gmail.com', 2147483647, '$2y$10$1UrDcr6o60BULtcWC4XX7eaGZuvjQCUdisYWkLJ7.BzuCxmskxJqu', NULL, '2', '2019-02-25 18:01:55', NULL),
(21, 'Aysha', '1552387238_4149.jpg', 'ashamony305@gmail.com', 1779751273, '$2y$10$HDuo9TtAhTSnjitrzAEODe4IwqLvr1cqYmLJZJaC3a8Mh7pFAXNZu', NULL, '2', '2019-03-12 16:40:38', NULL),
(23, 'Computer', '1553578640_4812.jpg', 'tanzirnur@gmail.com', 1674437137, '$2y$10$0SeSOfMo5Nkt4ZPep9vy0efSfXYila7s5m2D1K2nnNmUyFwUtmRia', NULL, '2', '2019-03-26 11:37:20', NULL),
(24, 'Md.Nur-E-Alam', '1553578749_1316.jpg', 'tanzir1@gmail.com', 1674437137, '$2y$10$R6Tnyy/3noj4Oxf.lzWuTOA0cyBd2omkq2wgv7zTP.M2fw3EQBUsu', NULL, '2', '2019-03-26 11:39:09', NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `authors`
--
ALTER TABLE `authors`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `books_category`
--
ALTER TABLE `books_category`
  ADD PRIMARY KEY (`Id`);

--
-- Indexes for table `category`
--
ALTER TABLE `category`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `districts`
--
ALTER TABLE `districts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `division_id` (`division_id`);

--
-- Indexes for table `divisions`
--
ALTER TABLE `divisions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `group_name`
--
ALTER TABLE `group_name`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `images`
--
ALTER TABLE `images`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `profile`
--
ALTER TABLE `profile`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `user_id` (`user_id`);

--
-- Indexes for table `sessions`
--
ALTER TABLE `sessions`
  ADD PRIMARY KEY (`session_id`),
  ADD KEY `last_activity_idx` (`last_activity`);

--
-- Indexes for table `upazilas`
--
ALTER TABLE `upazilas`
  ADD PRIMARY KEY (`id`),
  ADD KEY `district_id` (`district_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`user_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `authors`
--
ALTER TABLE `authors`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `books`
--
ALTER TABLE `books`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=70;

--
-- AUTO_INCREMENT for table `books_category`
--
ALTER TABLE `books_category`
  MODIFY `Id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=141;

--
-- AUTO_INCREMENT for table `category`
--
ALTER TABLE `category`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;

--
-- AUTO_INCREMENT for table `comments`
--
ALTER TABLE `comments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `districts`
--
ALTER TABLE `districts`
  MODIFY `id` int(2) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=65;

--
-- AUTO_INCREMENT for table `divisions`
--
ALTER TABLE `divisions`
  MODIFY `id` int(2) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `group_name`
--
ALTER TABLE `group_name`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `images`
--
ALTER TABLE `images`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `profile`
--
ALTER TABLE `profile`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT for table `upazilas`
--
ALTER TABLE `upazilas`
  MODIFY `id` int(2) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=493;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `districts`
--
ALTER TABLE `districts`
  ADD CONSTRAINT `districts_ibfk_1` FOREIGN KEY (`division_id`) REFERENCES `divisions` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `upazilas`
--
ALTER TABLE `upazilas`
  ADD CONSTRAINT `upazilas_ibfk_1` FOREIGN KEY (`district_id`) REFERENCES `districts` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
